<a href="https://colab.research.google.com/github/DheerajkumarNayak/18CSE019/blob/main/DataPreprocessing_lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'https://raw.githubusercontent.com/DheerajkumarNayak/18CSE019/main/Bank_churn_modelling.csv')

In [3]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [4]:
df.duplicated().sum() ## cheaking for duplicate value.

0

In [5]:
df.isnull().sum() # cheaking for missing value.

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [6]:
df.drop(['Surname','RowNumber','CustomerId'],axis=1,inplace=True) # Deleting the coloums which are not reqired. 
df.columns

Index(['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance',
       'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary',
       'Exited'],
      dtype='object')

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.shape

(10000, 11)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [12]:
df.index

RangeIndex(start=0, stop=10000, step=1)

In [13]:
df.columns

Index(['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance',
       'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary',
       'Exited'],
      dtype='object')

In [14]:
df[['CreditScore','Geography']].head(10) #To know the information of perticular coloum.

   CreditScore Geography
0          619    France
1          608     Spain
2          502    France
3          699    France
4          850     Spain
5          645     Spain
6          822    France
7          376   Germany
8          501    France
9          684    France

In [15]:
df.dropna(inplace=True) # removed the null values by removing the whole row.
df.isnull().sum()

CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [16]:
df['CreditScore'].replace(np.NaN,df['CreditScore'].mean()).head() # remove the null value by replacing it with the mean of that perticular coloum.

0    619
1    608
2    502
3    699
4    850
Name: CreditScore, dtype: int64

In [17]:
df.dropna(thresh=4,inplace=True) # removes all the row which does not have atleast 4 theshold values

In [18]:
df.shape

(10000, 11)